In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
import warnings
warnings.filterwarnings("ignore")

In [3]:
df = pd.DataFrame({"New York":[25]})

In [4]:
df

   New York
0        25

In [5]:
df.melt()

   variable  value
0  New York     25

In [6]:
df = pd.DataFrame({"New York":[25], 
                   "Paris":[27], 
                   "London":[30]})

In [7]:
df

   New York  Paris  London
0        25     27      30

In [8]:
df.melt()

   variable  value
0  New York     25
1     Paris     27
2    London     30

In [9]:
df_larger = pd.DataFrame({"New York":[25,27,23,25,29], 
                   "Paris":[27,22,24,26,28], 
                   "London":[30,31,33,29,25]})

In [10]:
df_larger

   New York  Paris  London
0        25     27      30
1        27     22      31
2        23     24      33
3        25     26      29
4        29     28      25

In [11]:
df_larger.melt(var_name="City", value_name="Temperature")

        City  Temperature
0   New York           25
1   New York           27
2   New York           23
3   New York           25
4   New York           29
5      Paris           27
6      Paris           22
7      Paris           24
8      Paris           26
9      Paris           28
10    London           30
11    London           31
12    London           33
13    London           29
14    London           25

In [12]:
temperatures = pd.DataFrame({
'city': ['New York', 'London', 'Paris', 'Berlin', 'Amsterdam'],
'day1': [23, 25, 27, 26, 24],
'day2': [22, 21, 25, 26, 23],
'day3': [26, 25, 24, 27, 23],
'day4': [23, 21, 22, 26, 27],
'day5': [27, 26, 27, 24, 28]
})
temperatures

        city  day1  day2  day3  day4  day5
0   New York    23    22    26    23    27
1     London    25    21    25    21    26
2      Paris    27    25    24    22    27
3     Berlin    26    26    27    26    24
4  Amsterdam    24    23    23    27    28

In [13]:
# 'id_vars' (any columns we want to keep, don't want to melt)
temperatures.melt(id_vars = ["city"],
                 var_name="date",
                 value_name="temp")

         city  date  temp
0    New York  day1    23
1      London  day1    25
2       Paris  day1    27
3      Berlin  day1    26
4   Amsterdam  day1    24
5    New York  day2    22
6      London  day2    21
7       Paris  day2    25
8      Berlin  day2    26
9   Amsterdam  day2    23
10   New York  day3    26
11     London  day3    25
12      Paris  day3    24
13     Berlin  day3    27
14  Amsterdam  day3    23
15   New York  day4    23
16     London  day4    21
17      Paris  day4    22
18     Berlin  day4    26
19  Amsterdam  day4    27
20   New York  day5    27
21     London  day5    26
22      Paris  day5    27
23     Berlin  day5    24
24  Amsterdam  day5    28